# -*- coding:utf-8 -*-
# 转换系数
from __future__ import unicode_literals
'''
标准煤炭转换系数
二氧化碳转换系数
能源序号
'''
STATND_COAL_COEFFICIENT = {
    u'原煤' : 0.7143,
    u'洗精煤' : 0.900,
    u'其他洗煤' : 0.2857,
    u'型煤' : 0.5000,
    u'焦炭' : 0.9714,
    u'焦炉煤气' : 5.714,
    u'其他煤气' : 5.571,
    u'原油' : 1.4286,
    u'汽油' : 1.4714,
    u'煤油' : 1.4714,
    u'柴油' : 1.4571,
    u'燃料油' : 1.4286,
    u'液化石油气' : 1.7143,
    u'炼厂干气' : 1.5714,
    u'天然气' : 13.30,
    u'热力' : 0.0341,
    u'电力' : 1.2290
}

CO2_COEFFICIENT = {
    u'原煤' : 1.9779,
    u'洗精煤' : 2.4921424,
    u'其他洗煤' : 0.79114,
    u'型煤' : 2.03853,
    u'焦炭' : 0.3043,
    u'焦炉煤气' : 7.426,
    u'其他煤气' : 17.450,
    u'原油' : 3.0651,
    u'汽油' : 3.0149,
    u'煤油' : 3.0795,
    u'柴油' : 3.1605,
    u'燃料油' : 3.2366,
    u'液化石油气' : 3.1663,
    u'炼厂干气' : 2.6495,
    u'天然气' : 18.086
}
ENERGY_TYPE_INDEX = {
    u'原煤' : 0,
    u'洗精煤' : 1,
    u'其他洗煤' : 2,
    u'型煤' : 3,
    u'焦炭' : 4,
    u'焦炉煤气' : 5,
    u'其他煤气' : 6,
    u'原油' : 7,
    u'汽油' : 8,
    u'煤油' : 9,
    u'柴油' : 10,
    u'燃料油' : 11,
    u'液化石油气' : 12,
    u'炼厂干气' : 13,
    u'天然气' : 14,
}
CEF = {}
for k, v in ENERGY_TYPE_INDEX.iteritems():
    CEF[v] = CO2_COEFFICIENT[k] / STATND_COAL_COEFFICIENT[k]
